import random
import string

def demo_of_functionality():
    print('''
Чем Вам помочь?
    
1. Сгенерировать пароль 
2. Порекомендуй фильм 
3. Порекомендуй блюдо на ужин 
4. Включи калькулятор 
5. Сыграем в орёл и решка 
6. Сыграем в камень, ножницы, бумага

Для выхода напишите '项目完成' (или 'Выход')
''')

def function_1():
    chars = string.ascii_letters + string.digits + string.punctuation
    pass_len = int(input('Введите длину пароля: '))
    password = ''.join(random.choices(chars, k=pass_len))
    print(f'Ваш пароль: {password}')


def function_2():
    movies = [
        "Интерстеллар", "Матрица", "Бегущий по лезвию 2049", "Начало",
        "Безумный Макс: Дорога ярости", "Терминатор 2: Судный день", "Криминальное чтиво", "Карты, деньги, два ствола",
        "Большой куш", "Бешеные псы", "Драйв", "Леон",
        "Бойцовский клуб", "Остров проклятых", "Престиж", "Семь",
        "Молчание ягнят", "Помни", "Темный рыцарь", "Побег из Шоушенка",
        "Гладиатор", "Джанго освобожденный", "Таксист", "Большой Лебовски"
    ]
    selected_movie = random.choice(movies)
    print(f'Рекомендуем посмотреть: {selected_movie}2')

def function_3():
    dinners = [
        "Паста Карбонара с гуанчале и пекорино", "Лазанья Болоньезе",
        "Ризотто с белыми грибами и пармезаном", "Пицца «Четыре сыра»",
        "Паста с креветками в сливочно-чесночном соусе", "Орекьетте с вялеными томатами и базиликом",
        "Капрезе с песто и чиабаттой", "Ньокки в томатном соусе с моцареллой",
        "Удон с говядиной и овощами в соусе терияки", "Рамен со свининой тясю и яйцом",
        "Курица Гунбао с арахисом и рисом", "Пад Тай с креветками и лаймом",
        "Фунчоза с овощами и хрустящей курочкой", "Том Ям с морепродуктами",
        "Стейк Рибай со спаржей", "Запеченный лосось с розмарином",
        "Утиная грудка магрэ с ягодным соусом", "Бефстроганов с картофельным пюре",
        "Куриное филе Кордон Блю", "Боул с авокадо, лососем и киноа",
        "Греческий салат с фетой и багетом", "Салат Цезарь с креветками на гриле",
        "Киш с курицей и грибами", "Запеченные овощи с сыром халуми"
    ]

    dinner = random.choice(dinners)
    print(f'Как насчёт: {dinner}?')

def function_4():
    print("""
Доступные действия: '+', '-', '*', '/', '//', '%'
Для завершения введите: 'Exit' или 'Выход'
""")


def function_5():
    return

def function_6():
    return

actions = {
    '1': function_1,
    '2': function_2,
    '3': function_3,
    '4': function_4,
    '5': function_5,
    '6': function_6
}

print('Добро пожаловать в многофункцонального передового отечественного нейросетевого бота LLM 5G!')

while True:
    demo_of_functionality()
    num_of_function = input('Введите номер необходимой функции: ')
    if num_of_function == 'Выход' or num_of_function == 'выход' or num_of_function == '项目完成':
        break
    func = actions.get(num_of_function)
    if func:
        func()
    else:
        print('Некорректный ввод, повторите попытку')